app/views/home/index.html.haml

SELECT "categories".* FROM "categories"
---
            -if @counter==1
              %li.category-list.selected-category-list{"ui-sref" => "home.filer({filter: '#{category.id}'})"}

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 3]]
---
                  BY:
                  = User.find(socials_need.user_id).name
              .description