app/controllers/categories_controller.rb

INSERT INTO "categories" ("level", "integer", "name", "string", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["level", "1"], ["integer", "1"], ["name", "Sociales"], ["string", "Sociales"], ["created_at", "2016-02-06 18:34:34.989111"], ["updated_at", "2016-02-06 18:34:34.989111"]]
---
  def create
    @category = Category.new(category_params)

    if @category.save