app/controllers/home_controller.rb

SELECT "categories".* FROM "categories"
---
  def index
    @social_needs = SocialsNeed.first(3)
    @categories= Category.all