app/controllers/socials_needs_controller.rb

SELECT "socials_needs".* FROM "socials_needs"
---
  def index
    @socials_needs = SocialsNeed.all

INSERT INTO "socials_needs" ("user_id", "name", "description", "latitude", "longitude", "address", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"  [["user_id", ""], ["name", ""], ["description", ""], ["latitude", ""], ["longitude", ""], ["address", ""], ["created_at", "2016-03-15 17:05:36.787664"], ["updated_at", "2016-03-15 17:05:36.787664"]]
---
  def create
    if current_user != nil
      @socials_need = SocialsNeed.new(socials_need_params)
      @socials_need.user_id = current_user.id
      @category_id = params[:socials_need][:category_id].strip.delete("\n").delete("\r")

      begin
        @category_id= Category.where(:name => @category_id).take
        @category_id = @category_id.id
        puts "ID:  " + @category_id.to_s
        @socials_need.category_id = @category_id
      rescue Exception => e
        @category_id = 0
      end
      @success=""
      if @socials_need.save

SELECT  "socials_needs".* FROM "socials_needs" WHERE "socials_needs"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_socials_need
      @socials_need = SocialsNeed.find(params[:id])