app/controllers/socials_need_images_controller.rb

  def index
    @socials_need_images = SocialsNeedImage.all
---
SELECT "socials_need_images".* FROM "socials_need_images"

  def create
    @socials_need_image = SocialsNeedImage.new(socials_need_image_params)

    if @socials_need_image.save
---
INSERT INTO "socials_need_images" ("socials_need_id", "image_content_file_name", "image_content_content_type", "image_content_file_size", "image_content_updated_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def set_socials_need_image
      @socials_need_image = SocialsNeedImage.find(params[:id])
---
SELECT  "socials_need_images".* FROM "socials_need_images" WHERE "socials_need_images"."id" = $1 LIMIT 1  [["id", 1]]