app/controllers/town_need_categories_controller.rb

SELECT "town_need_categories".* FROM "town_need_categories"
---
  def index
    @town_need_categories = TownNeedCategory.all