app/controllers/users_controller.rb

INSERT INTO "users" ("email", "slug", "password_salt", "password_hash", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    @error_creation =''
    @success = false
    respond_to do |format|
      if @user.save